; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v1 ?v13)
             (pred_9 ?v7 ?v6)
             (pred_1 ?v1 ?v6)
             (pred_10 ?v11 ?v1 )
	     (pred_7 ?v1)
             (pred_5 ?v8)
             (pred_4 ?v7)
             (pred_8 ?v6)
             (pred_6 ?v1)
             (pred_11 ?v7)
             (pred_12 ?v1)
             (pred_2 ))



(:action op_2
:parameters (?v12 ?v3 ?v2 ?v5)
:precondition (and (pred_5 ?v12) (pred_5 ?v3) (pred_4 ?v2) (pred_8 ?v5)
          (pred_3 ?v12 ?v3) (pred_9 ?v2 ?v5)
                   (pred_1 ?v3 ?v5) (pred_7 ?v12) 
                   (pred_6 ?v3) (pred_11 ?v2))
:effect (and  (pred_12 ?v3) (not (pred_6 ?v3))))


(:action op_5
:parameters (?v12 ?v4)
:precondition (and (pred_5 ?v12) (pred_5 ?v4)
               (pred_7 ?v12) (pred_3 ?v12 ?v4) (pred_12 ?v4))
:effect (and (pred_7 ?v4) (not (pred_7 ?v12))))

(:action op_1
:parameters (?v12 ?v2)
:precondition (and (pred_5 ?v12) (pred_4 ?v2) 
                  (pred_7 ?v12) (pred_10 ?v2 ?v12) (pred_2 ))
:effect (and (pred_11 ?v2)
   (not (pred_10 ?v2 ?v12)) (not (pred_2 ))))


(:action op_4
:parameters (?v12 ?v9 ?v10)
:precondition (and (pred_5 ?v12) (pred_4 ?v9) (pred_4 ?v10)
                  (pred_7 ?v12) (pred_11 ?v10) (pred_10 ?v9 ?v12))
:effect (and (pred_11 ?v9) (pred_10 ?v10 ?v12)
        (not (pred_11 ?v10)) (not (pred_10 ?v9 ?v12))))

(:action op_3
:parameters (?v12 ?v2)
:precondition (and (pred_5 ?v12) (pred_4 ?v2) 
                  (pred_7 ?v12) (pred_11 ?v2))
:effect (and (pred_2 ) (pred_10 ?v2 ?v12) (not (pred_11 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_11 obj_05 obj_13 obj_01 obj_07 obj_16 obj_14 obj_09 obj_03 obj_06 obj_18 obj_19 obj_08 obj_04 obj_22
    obj_12 obj_10 obj_21
    obj_15 obj_17 obj_20
    )

    (:init
       (pred_2)

       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_05)
       (pred_5 obj_13)
       (pred_5 obj_01)
       (pred_5 obj_07)
       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_06)
       (pred_5 obj_18)
       (pred_5 obj_19)
       (pred_5 obj_08)
       (pred_5 obj_04)
       (pred_5 obj_22)
       (pred_8 obj_12)
       (pred_8 obj_10)
       (pred_8 obj_21)
       (pred_4 obj_15)
       (pred_4 obj_17)
       (pred_4 obj_20)

       (pred_3 obj_02 obj_01)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_11 obj_05)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_05 obj_16)
       (pred_3 obj_05 obj_13)
       (pred_3 obj_05 obj_11)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_13 obj_05)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_16 obj_06)
       (pred_3 obj_16 obj_14)
       (pred_3 obj_16 obj_05)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_14 obj_18)
       (pred_3 obj_14 obj_13)
       (pred_3 obj_14 obj_16)
       (pred_3 obj_09 obj_19)
       (pred_3 obj_09 obj_03)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_03 obj_08)
       (pred_3 obj_03 obj_06)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_09)
       (pred_3 obj_06 obj_04)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_06 obj_16)
       (pred_3 obj_06 obj_03)
       (pred_3 obj_18 obj_22)
       (pred_3 obj_18 obj_14)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_19 obj_08)
       (pred_3 obj_19 obj_09)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_08 obj_03)
       (pred_3 obj_08 obj_19)
       (pred_3 obj_04 obj_22)
       (pred_3 obj_04 obj_06)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_22 obj_18)
       (pred_3 obj_22 obj_04)
       (pred_6 obj_06)
       (pred_6 obj_01)
       (pred_6 obj_14)
       (pred_1  obj_06 obj_12)
       (pred_1  obj_01 obj_10)
       (pred_1  obj_14 obj_21)
       (pred_12 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_07)
       (pred_12 obj_16)
       (pred_12 obj_09)
       (pred_12 obj_03)
       (pred_12 obj_18)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_04)
       (pred_12 obj_22)

       (pred_9  obj_15 obj_12)
       (pred_9  obj_17 obj_10)
       (pred_9  obj_20 obj_21)
       (pred_10 obj_15 obj_09)
       (pred_10 obj_17 obj_09)
       (pred_10 obj_20 obj_22)
       (pred_7 obj_09)
    )

    (:goal (and
       (pred_10 obj_17 obj_13)
    ))
(:constraints
  (always (not (pred_7 obj_11)))
)
)

; plan
1. (op_1 obj_09 obj_17)
   deleted: (pred_10 obj_17 obj_09) (pred_2)
   added: (pred_11 obj_17)
   goals met: 0 of 1
2. (op_5 obj_09 obj_03)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_03)
   goals met: 0 of 1
3. (op_5 obj_03 obj_07)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_07)
   goals met: 0 of 1
4. (op_5 obj_07 obj_16)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_16)
   goals met: 0 of 1
5. (op_5 obj_16 obj_05)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_05)
   goals met: 0 of 1
6. (op_5 obj_05 obj_13)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_13)
   goals met: 0 of 1
7. (op_3 obj_13 obj_17)
   deleted: (pred_11 obj_17)
   added: (pred_2) (pred_10 obj_17 obj_13)
   goals met: 1 of 1
